ams/src/Catalogs/ДатаМобайл_ШаблоныДокументов_ЕГАИС/ДатаМобайл_ШаблоныДокументов_ЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДатаМобайл_ШаблоныДокументов_ЕГАИС</name>
  <attributes>
    <name>БыстроеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияЕГАИС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаНового</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяПечатнаяФорма</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВсеДокументыШаблона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВыполненныйНаТСДДокументАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьРоботом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТолькоПроведенныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГенерацияПаклистаНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповаяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповаяРаботаЗвуковоеОповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповаяРаботаИнтервалОпроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнятьДокументПартионнымиТоварами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретСканированияУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТабличнойЧастиНовойПодбор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТабличнойЧастиПодбор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеСерийниковПодбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеУпаковочныхЛистовПодбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВыборочнуюПроверку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМарокВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаЕстьВБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимыеИдентификаторыСтрокТТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьОтветственногоМенеджера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПриКаждомОткрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьТоварыСДокументом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьРоботом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсылатьГотовуюЗаписьНаСерверПодбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторныйВводАМИзДругихДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждатьЭнтеромПодбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательДляАвтозаполнения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриПревышенииЗаданияПодбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриСканированииНовогоТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриСканированииТовараПодбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаМарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьРоботом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеноСозданиеНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВыгрузкуНеполногоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнойВводКоличестваПодбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СканированиеDataMatrix</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СканированиеEanБутылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СканированиеEanКороба</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СканированиеМарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладДляДокументаЧекККМ</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СопоставлениеЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнуюЧастьПриЗагрузкеПодбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалениеСтарыхДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФоноваяПроверкаМарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыУсловияВыгрузки</name>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НовыеЗначенияРеквизитов</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизита</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/ДатаМобайл_ШаблоныДокументов_ЕГАИС/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаСервереБезКонтекста
Функция ДокументПодходит(МетаДок)
	Для Каждого МетаТЧ из МетаДок.ТабличныеЧасти цикл
		Для Каждого МетаРеквизитТЧ из МетаТЧ.Реквизиты цикл
			Если МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.Номенклатура")) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Возврат ложь;
КонецФункции

&НаСервереБезКонтекста
Функция ДокументПодходитЕГАИС(МетаДок)
	Если МетаДок.Имя = "РеализацияТоваровУслуг" 
		или МетаДок.Имя = "ЗаказКлиента" 
		или  МетаДок.Имя =  "СписаниеНедостачТоваров" 
		или МетаДок.Имя =  "ОрдерНаОтражениеНедостачТоваров"
		или МетаДок.Имя =  "ВозвратТоваровПоставщику"
		или МетаДок.Имя = "ЧекККМ"
		или МетаДок.Имя = "ПеремещениеТоваров"
		или МетаДок.Имя = "ПересчетТоваров" тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого МетаТЧ из МетаДок.ТабличныеЧасти цикл
		Для Каждого МетаРеквизитТЧ из МетаТЧ.Реквизиты цикл
			Если МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.алкКлассификаторАлкогольнойПродукцииЕГАИС")) Тогда
				Возврат Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Возврат ложь;
КонецФункции

&НаСервереБезКонтекста
Функция СобратьВидыДокументовЕГАИС(Список)
	для каждого МетаДок из метаданные.Документы Цикл
		Если ДокументПодходитЕГАИС(МетаДок) тогда
			Список.Добавить(МетаДок.Имя,МетаДок.Синоним);
		КонецЕсли;	
	КонецЦикла;
КонецФункции	

&НаСервереБезКонтекста
Функция СобратьТабЧастиДокументов(ВидДокумента,Список)
	Список.Очистить();
	МетаДок=Метаданные.Документы.Найти(ВидДокумента);
	Если МетаДок=Неопределено тогда
		Возврат Ложь;
	КонецЕсли;	
	Для Каждого МетаТЧ из МетаДок.ТабличныеЧасти цикл
		Для Каждого МетаРеквизитТЧ из МетаТЧ.Реквизиты цикл
			Если МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.Номенклатура")) ИЛИ
				МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.алкКлассификаторАлкогольнойПродукцииЕГАИС")) Тогда
				
				Если Список.НайтиПоЗначению(МетаТЧ.Имя) <> Неопределено тогда
					Продолжить;
				КонецЕсли;
				
				Список.Добавить(МетаТЧ.Имя);
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
КонецФункции	

&НаСервереБезКонтекста
Функция СобратьРеквизитыДокумента(ВидДокумента,Список)
	Список.Очистить();
	МетаДок=Метаданные.Документы.Найти(ВидДокумента);
	Если МетаДок=Неопределено тогда
		Возврат Ложь;
	КонецЕсли;	
	Для Каждого МетаРеквизит из МетаДок.Реквизиты цикл
		Список.Добавить(МетаРеквизит.Имя);
	КонецЦикла;
КонецФункции	

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	НовСписок=Новый СписокЗначений();
	СобратьТабЧастиДокументов(Объект.ВидДокумента,НовСписок);
	Элементы.ИмяТабличнойЧастиПодбор.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	
	Если Объект.ВидДокументаНового="" тогда
		НовСписок=Новый СписокЗначений();
		СобратьРеквизитыДокумента(Объект.ВидДокумента,НовСписок);
		Элементы.НовыеЗначенияРеквизитовИмяРеквизита.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	КонецЕслИ;	
	
	Объект.ИмяТабличнойЧастиПодбор = "Товары";
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаНовогоПриИзменении(Элемент)
	НовСписок=Новый СписокЗначений();
	СобратьТабЧастиДокументов(Объект.ВидДокументаНового,НовСписок);
	Элементы.ИмяТабличнойЧастиНовойПодбор.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	
	НовСписок=Новый СписокЗначений();
	СобратьРеквизитыДокумента(Объект.ВидДокументаНового,НовСписок);
	Элементы.НовыеЗначенияРеквизитовИмяРеквизита.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	Элементы.ТабличнуюЧастьПриЗагрузкеПодбор.Заголовок=?(Объект.ВидДокументаНового="","Режим записи табличной части исходного документа","Режим записи табличной части нового документа");
	
	Объект.ИмяТабличнойЧастиНовойПодбор = "Товары";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ТабличнуюЧастьПриЗагрузкеПодбор.Заголовок=?(Объект.ВидДокументаНового="","Режим записи табличной части исходного документа","Режим записи табличной части нового документа");
	
	ДоступностьВыгружатьВсеДокументыШаблона();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() тогда
		Объект.ЕГАИС=Истина;
		Объект.ВерсияЕГАИС=1; 
		
		Объект.РазрешеноСозданиеНаТСД 					= Истина;
		//Объект.РежимСозданияДокументов 					= 1;	
		Объект.ОбновлятьТоварыСДокументом 				= Истина;
		Объект.РазрешитьВыгрузкуНеполногоДокумента 		= 1;
		Объект.ПриСканированииНовогоТовара 				= 1;
		//Объект.ШтрихкодыТолькоПоШаблонам 				= Истина;
		//Объект.ПервичныйПоискПоШКвЗадании 				= Истина;
		//Объект.ВсеШтрихкодыТовара                       = Истина;
		//Объект.ЗагружатьКомментарий                 	= 0;
		//Объект.АвтоматическийКомментарийИспользовать 	= Истина;
		//Объект.АвтоматическийКомментарий 				= "Выполнено в DataMobile";
		
		//Объект.ИспользоватьПодбор 						= Истина;
		//Объект.ТабличнуюЧастьПриЗагрузкеПодбор 			= 3;
		Объект.ПриСканированииТовараПодбор         		= 2;
		Объект.ПриПревышенииЗаданияПодбор          		= 1;
		Объект.РучнойВводКоличестваПодбор          		= Истина;
		Объект.ПодтверждатьЭнтеромПодбор           		= Истина;
	КонецЕсли;	
	СобратьВидыДокументовЕГАИС(Элементы.ВидДокумента.СписокВыбора);
	СобратьВидыДокументовЕГАИС(Элементы.ВидДокументаНового.СписокВыбора);
	
	СобратьТабЧастиДокументов(Объект.ВидДокумента,Элементы.ИмяТабличнойЧастиПодбор.СписокВыбора);	
	СобратьТабЧастиДокументов(Объект.ВидДокументаНового,Элементы.ИмяТабличнойЧастиНовойПодбор.СписокВыбора);
	
	Если Объект.ВидДокументаНового="" тогда
		СобратьРеквизитыДокумента(Объект.ВидДокумента,Элементы.НовыеЗначенияРеквизитовИмяРеквизита.СписокВыбора);
	Иначе	
		СобратьРеквизитыДокумента(Объект.ВидДокументаНового,Элементы.НовыеЗначенияРеквизитовИмяРеквизита.СписокВыбора);
	КонецЕслИ;	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьПараметры(Команда)
	лТекст=СтрЗаменить(Объект.УсловиеВыгрузки,"&"," &");
	лТекст=СтрЗаменить(лТекст," ",Символы.ПС);
	Объект.ПараметрыУсловияВыгрузки.Очистить();
	Для ш=1 по СтрЧислоСтрок(лТекст) цикл
		Если Лев(СтрПолучитьСтроку(лТекст,ш),1)="&" тогда
			новСтр=Объект.ПараметрыУсловияВыгрузки.Добавить();
			новСтр.ИмяПараметра=Сред(СтрПолучитьСтроку(лТекст,ш),2);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НовыеЗначенияРеквизитовЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТИПЗНЧ(Элементы.НовыеЗначенияРеквизитов.ТекущиеДанные.ЗначениеРеквизита) = ТИП("СправочникСсылка.СкладскиеПомещения") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЗакрытиеВыбораПомещения", ЭтотОбъект),ПолучитьСписокПомещений(),Элементы.НовыеЗначенияРеквизитов,0);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПомещений() 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СкладскиеПомещения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеПомещения КАК СкладскиеПомещения");
	
	СписокВозврата = Новый СписокЗначений;
	СписокВозврата.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат СписокВозврата;
	
КонецФункции

&Наклиенте
Процедура ЗакрытиеВыбораПомещения(Результат, ДопПараметры) Экспорт
	
	Элементы.НовыеЗначенияРеквизитов.ТекущиеДанные.ЗначениеРеквизита = Результат.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУпрощенныйВводУсловийНажатие(Команда)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидДокумента"		, Объект.ВидДокумента);
	ПараметрыФормы.Вставить("ПараметрыЗначений"	, ВыгрузитьПараметрыУсловияВыгрузки());
	
	ФормаУсловий = ПолучитьФорму("Обработка.ДатаМобайл_АРМДиспетчера.Форма.ФормаУсловийАвтовыгрузки", ПараметрыФормы, ЭтотОбъект,,,);
	ФормаУсловий.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытьФормаУсловийАвтовыгрузки" Тогда
		ОбработкаОповещенияСервер(Параметр);
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ВыгрузитьПараметрыУсловияВыгрузки()
	Возврат ПоместитьВоВременноеХранилище(Объект.ПараметрыУсловияВыгрузки.Выгрузить());	
КонецФункции

&НаСервере
Процедура ОбработкаОповещенияСервер(Параметр)
	
	Объект.УсловиеВыгрузки = "";
	Объект.ПараметрыУсловияВыгрузки.Загрузить(ПолучитьИзВременногоХранилища(Параметр));
	
	Сч = 0;
	
	Для каждого СтрокаУсловия Из Объект.ПараметрыУсловияВыгрузки Цикл
		
		Если Сч > 0 Тогда
			Объект.УсловиеВыгрузки = Символы.ПС + "И" + Символы.ПС + Объект.УсловиеВыгрузки;	
		КонецЕсли; 
		
		Условие 		= СтрокаУсловия.Условие;
		ИмяПараметра    = СтрокаУсловия.ИмяПараметра;
		
		Операция = ВычислитьОперациюСравнения(Условие);
		
		Если Условие = 7 Или Условие = 8 Тогда
			ОперацияПараметр = Операция + "(&" + ИмяПараметра + ")";
		Иначе
			ОперацияПараметр = Операция + "&" + ИмяПараметра;
		КонецЕсли; 
		
		Объект.УсловиеВыгрузки = "Документ1с." + ИмяПараметра + ОперацияПараметр + Объект.УсловиеВыгрузки;
		
		Сч = Сч + 1;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВычислитьОперациюСравнения(Условие)
	
	//Условия
	//(0, "Равно")
	//(1, "Не Равно")
	//(3, "Больше")
	//(4, "Меньше")
	//(5, "Больше или Равно")
	//(6, "Меньше или Равно")
	//(7, "В Списке")
	//(8, "Не В Списке")
	
	Если Условие = "Не Равно" Тогда
		Операция = " <> ";
	ИначеЕсли Условие = "Больше" Тогда
		Операция = " > ";
	ИначеЕсли Условие = "Меньше" Тогда
		Операция = " < ";
	ИначеЕсли Условие = "Больше или Равно" Тогда
		Операция = " >= ";
	ИначеЕсли Условие = "Меньше или Равно" Тогда
		Операция = " <= ";
	ИначеЕсли Условие = "В Списке" Тогда
		Операция = " В ";
	ИначеЕсли Условие = "Не В Списке" Тогда
		Операция = " НЕ В ";	
	Иначе
		Операция = " = ";
	КонецЕсли; 
	
	Возврат Операция;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВыгружатьРоботом Тогда 	
		Если (ЗначениеЗаполнено(Объект.УсловиеВыгрузки) И Объект.ВыгружатьВсеДокументыШаблона)
			ИЛИ (НЕ ЗначениеЗаполнено(Объект.УсловиеВыгрузки) И НЕ Объект.ВыгружатьВсеДокументыШаблона) Тогда
			Отказ = Истина;
			ЭтаФорма.Модифицированность = Истина;
			Сообщить("Укажите условие выгрузки или поставьте галочку ""Выгружать все документы шаблона"" во вкладке ""Автовыгрузка""!");
		КонецЕсли;
	КонецЕсли;	   	
	
		
	Если Объект.ИмяТабличнойЧастиПодбор = "" Тогда		
		Отказ = Истина;
		ЭтаФорма.Модифицированность = Истина;
		Сообщить("Необходимо указать табличную часть! ");		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Объект.ВидДокументаНового) 
		И Не ЗначениеЗаполнено(Объект.ИмяТабличнойЧастиНовойПодбор) Тогда		
		Отказ = Истина;
		Сообщить("Укажите табличную часть нового (подчиненного документа) на вкладке ""Подбор""!");
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьРоботомПриИзменении(Элемент)
	
	ДоступностьВыгружатьВсеДокументыШаблона();
	Если НЕ Объект.ВыгружатьРоботом Тогда
		Объект.ВыгружатьВсеДокументыШаблона = Объект.ВыгружатьРоботом;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьВыгружатьВсеДокументыШаблона()
	
	Элементы.ВыгружатьВсеДокументыШаблона.Доступность = Объект.ВыгружатьРоботом;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьВсеДокументыШаблонаПриИзменении_Завершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Объект.ВыгружатьВсеДокументыШаблона = Ложь; 	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьВсеДокументыШаблонаПриИзменении(Элемент)
	
	Если Объект.ВыгружатьВсеДокументыШаблона Тогда
		
		Оповещение = Новый ОписаниеОповещения(
		"ВыгружатьВсеДокументыШаблонаПриИзменении_Завершение",
		ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "При активации ""Выгружать все документы шаблона"" будут выгружены все документы без условий!", РежимДиалогаВопрос.ОКОтмена);
		
	КонецЕсли;		  
	
КонецПроцедуры
